diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_УчетОтпусков</registerRecords>
  <attributes>
    <name>ВКМ_год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/AccumulationRegisters/ВКМ_УчетОтпусков/ВКМ_УчетОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_УчетОтпусков</name>
  <resources>
    <name>ВКМ_Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) 

	Для каждого Строка Из ВКМ_ОтпускаСотрудников Цикл   
		
		Если ЗначениеЗаполнено(Строка.ВКМ_ДатаНачала) И ЗначениеЗаполнено(Строка.ВКМ_ДатаОкончания) Тогда 
			
			Если Строка.ВКМ_ДатаНачала > Строка.ВКМ_ДатаОкончания Тогда
				  
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В строке №%1 дата начала больше даты окончания",
																 Строка.НомерСтроки)); 
				Отказ = Истина; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла;  

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ВКМ_УчетОтпусков.Записывать = Истина;
				
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_Сотрудник КАК Сотрудник,
	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_ДатаОкончания КАК ДатаОкончания,
	|	РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_ДатаНачала,
	|		ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_ДатаОкончания, ДЕНЬ) + 1 КАК КоличествоДней
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ВКМ_ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников
	|ГДЕ
	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.Ссылка = &Ссылка
	|ИТОГИ
	|	СУММА(КоличествоДней)
	|ПО
	|	Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	БазаОтпуска = 28;
	
	Пока Результат.Следующий() Цикл
		
		ПревышеноДней = Результат.КоличествоДней - БазаОтпуска;
		
		Если ПревышеноДней > 0 Тогда     
			
			Отказ = Истина;

			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Привышено количество дней отпуска в год по сотруднику %1", Результат.Сотрудник));  
			
		КонецЕсли; 
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;    
		
		РезультатДетально = Результат.Выбрать();
		
		Пока РезультатДетально.Следующий() Цикл
			
			Движение = Движения.ВКМ_УчетОтпусков.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = РезультатДетально.ДатаОкончания;
			Движение.ВКМ_Сотрудник = РезультатДетально.Сотрудник;
			Движение.ВКМ_Значение = РезультатДетально.КоличествоДней;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры 


#КонецОбласти

#КонецЕсли
